interface AnimeCard {
  title: string
  description: string
  imgSrc: string
}

export const animeCards: AnimeCard[] = [
  {
    title: "Пожиратель Душ",
    description:
      "Для борьбы со злобным Кишином, который может ввергнуть мир в пучину безумия, Шинигами-сама создаёт Академию — место, где проходит совместное обучение Оружий и Повелителей. Первые являются тем самым оружием, которое позволит остановить гибель мира; вторые — те, кто будет управлять этим оружием. Косу Смерти можно создать, если оружие съест 99 злых душ, готовых стать Кишином, и 1 душу ведьмы, а потому все повелители активно соревнуются в создании Косы Смерти. Ну что, вы готовы окунуться в мир приключений?",
    imgSrc: "/src/shared/assets/images/animeBanners/soulEater.jpg",
  },
  {
    title: "Рок-Тихоня!",
    description:
      "Крайне тревожная и социально неловкая Хитори Гото мечтает стать рок-музыкантом, несмотря на все трудности, и в то же время хочет однажды завести друзей. Ей внезапно предоставляется шанс сделать это после того, как другая девушка, Нидзика Идзити, приглашает её стать участницей своей недавно созданной группы «Жгут».",
    imgSrc: "/src/shared/assets/images/animeBanners/bocciTheRock.jpg",
  },
  {
    title: "Человек-бензопила",
    description:
      "Когда отец Денджи умер, он остался с огромным долгом. Благодаря псу-демону по имени Почита,  он научился выживать, выполняя случайные работы и убивая демонов. В момент предательства якудза он умирает от рук демона-зомби, Почита жертвует собой, чтобы спасти Денджи. После возрождения он становится гибридом человека и демона, став известным как Человек-бензопила.",
    imgSrc: "/src/shared/assets/images/animeBanners/chainsawman.jpg",
  },
  {
    title: "Фрирен, провожающая в последний путь",
    description:
      "Фрирен — член команды, одолевшей Короля Демонов. Она не герой, а — маг, и не человек, а — эльф, практически ничего не роднит её с остальными членами группы, к тому же ей отмерен гораздо больший жизненный срок, и ей суждено пережить своих былых товарищей...",
    imgSrc: "/src/shared/assets/images/animeBanners/frieren.jpg",
  },
  {
    title: "Ванпис",
    description:
      "Последние слова, произнесённые Королем Пиратов Гол Д. Роджером перед казнью, вдохновили многих выйти в море: «Мои сокровища? Я завещаю их тому, кто сможет их найти. Ищите! Я все оставил в одном месте!». Лишённые сна и покоя люди ринулись на Гранд Лайн, самое опасное место в мире. Так началась великая эра пиратов...",
    imgSrc: "/src/shared/assets/images/animeBanners/onePiece.jpg",
  },
]
